GopalSaraf/Practicals/PSDL/include/proc/pic16f15275.h
extern volatile NVMDATHbits_t NVMDATHbits __at(0x81D);
// bitfield macros
#define _NVMDATH_NVMDATH_POSN                               0x0
#define _NVMDATH_NVMDATH_POSITION                           0x0
#define _NVMDATH_NVMDATH_SIZE                               0x6
#define _NVMDATH_NVMDATH_LENGTH                             0x6
#define _NVMDATH_NVMDATH_MASK                               0x3F

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0x81E);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 081Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned LWLO                   :1;
        unsigned NVMREGS                :1;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0x81E);
// bitfield macros
#define _NVMCON1_RD_POSN                                    0x0
#define _NVMCON1_RD_POSITION                                0x0
#define _NVMCON1_RD_SIZE                                    0x1
#define _NVMCON1_RD_LENGTH                                  0x1
#define _NVMCON1_RD_MASK                                    0x1
#define _NVMCON1_WR_POSN                                    0x1
#define _NVMCON1_WR_POSITION                                0x1
#define _NVMCON1_WR_SIZE                                    0x1
#define _NVMCON1_WR_LENGTH                                  0x1
#define _NVMCON1_WR_MASK                                    0x2
#define _NVMCON1_WREN_POSN                                  0x2
#define _NVMCON1_WREN_POSITION                              0x2
#define _NVMCON1_WREN_SIZE                                  0x1
#define _NVMCON1_WREN_LENGTH                                0x1
#define _NVMCON1_WREN_MASK                                  0x4
#define _NVMCON1_WRERR_POSN                                 0x3
#define _NVMCON1_WRERR_POSITION                             0x3
#define _NVMCON1_WRERR_SIZE                                 0x1
#define _NVMCON1_WRERR_LENGTH                               0x1
#define _NVMCON1_WRERR_MASK                                 0x8
#define _NVMCON1_FREE_POSN                                  0x4
#define _NVMCON1_FREE_POSITION                              0x4
#define _NVMCON1_FREE_SIZE                                  0x1
#define _NVMCON1_FREE_LENGTH                                0x1
#define _NVMCON1_FREE_MASK                                  0x10
#define _NVMCON1_LWLO_POSN                                  0x5
#define _NVMCON1_LWLO_POSITION                              0x5
#define _NVMCON1_LWLO_SIZE                                  0x1
#define _NVMCON1_LWLO_LENGTH                                0x1
#define _NVMCON1_LWLO_MASK                                  0x20
#define _NVMCON1_NVMREGS_POSN                               0x6
#define _NVMCON1_NVMREGS_POSITION                           0x6
#define _NVMCON1_NVMREGS_SIZE                               0x1
#define _NVMCON1_NVMREGS_LENGTH                             0x1
#define _NVMCON1_NVMREGS_MASK                               0x40

// Register: NVMCON2
#define NVMCON2 NVMCON2
extern volatile unsigned char           NVMCON2             __at(0x81F);
#ifndef _LIB_BUILD
asm("NVMCON2 equ 081Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMCON2                :8;
    };
} NVMCON2bits_t;
extern volatile NVMCON2bits_t NVMCON2bits __at(0x81F);
// bitfield macros
#define _NVMCON2_NVMCON2_POSN                               0x0
#define _NVMCON2_NVMCON2_POSITION                           0x0
#define _NVMCON2_NVMCON2_SIZE                               0x8
#define _NVMCON2_NVMCON2_LENGTH                             0x8
#define _NVMCON2_NVMCON2_MASK                               0xFF

// Register: OSCCON
#define OSCCON OSCCON
extern volatile unsigned char           OSCCON              __at(0x88E);
#ifndef _LIB_BUILD
asm("OSCCON equ 088Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned COSC                   :2;
    };
    struct {
        unsigned NDIV0                  :1;
        unsigned NDIV1                  :1;
        unsigned NDIV2                  :1;
        unsigned NDIV3                  :1;
        unsigned NOSC0                  :1;
        unsigned NOSC1                  :1;
        unsigned NOSC2                  :1;
    };
} OSCCONbits_t;
extern volatile OSCCONbits_t OSCCONbits __at(0x88E);
// bitfield macros
#define _OSCCON_COSC_POSN                                   0x4
#define _OSCCON_COSC_POSITION                               0x4
#define _OSCCON_COSC_SIZE                                   0x2
#define _OSCCON_COSC_LENGTH                                 0x2
#define _OSCCON_COSC_MASK                                   0x30
#define _OSCCON_NDIV0_POSN                                  0x0
#define _OSCCON_NDIV0_POSITION                              0x0
#define _OSCCON_NDIV0_SIZE                                  0x1
#define _OSCCON_NDIV0_LENGTH                                0x1
#define _OSCCON_NDIV0_MASK                                  0x1
#define _OSCCON_NDIV1_POSN                                  0x1
#define _OSCCON_NDIV1_POSITION                              0x1
#define _OSCCON_NDIV1_SIZE                                  0x1
#define _OSCCON_NDIV1_LENGTH                                0x1
#define _OSCCON_NDIV1_MASK                                  0x2
#define _OSCCON_NDIV2_POSN                                  0x2
#define _OSCCON_NDIV2_POSITION                              0x2
#define _OSCCON_NDIV2_SIZE                                  0x1
#define _OSCCON_NDIV2_LENGTH                                0x1
#define _OSCCON_NDIV2_MASK                                  0x4
#define _OSCCON_NDIV3_POSN                                  0x3
#define _OSCCON_NDIV3_POSITION                              0x3
#define _OSCCON_NDIV3_SIZE                                  0x1
#define _OSCCON_NDIV3_LENGTH                                0x1
#define _OSCCON_NDIV3_MASK                                  0x8
#define _OSCCON_NOSC0_POSN                                  0x4
#define _OSCCON_NOSC0_POSITION                              0x4
#define _OSCCON_NOSC0_SIZE                                  0x1
#define _OSCCON_NOSC0_LENGTH                                0x1
#define _OSCCON_NOSC0_MASK                                  0x10
#define _OSCCON_NOSC1_POSN                                  0x5
#define _OSCCON_NOSC1_POSITION                              0x5
#define _OSCCON_NOSC1_SIZE                                  0x1
#define _OSCCON_NOSC1_LENGTH                                0x1
#define _OSCCON_NOSC1_MASK                                  0x20
#define _OSCCON_NOSC2_POSN                                  0x6
#define _OSCCON_NOSC2_POSITION                              0x6
#define _OSCCON_NOSC2_SIZE                                  0x1
#define _OSCCON_NOSC2_LENGTH                                0x1
#define _OSCCON_NOSC2_MASK                                  0x40

// Register: OSCSTAT
#define OSCSTAT OSCSTAT
extern volatile unsigned char           OSCSTAT             __at(0x890);
#ifndef _LIB_BUILD
asm("OSCSTAT equ 0890h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned SFOR                   :1;
        unsigned ADOR                   :1;
        unsigned                        :1;
        unsigned LFOR                   :1;
        unsigned MFOR                   :1;
        unsigned HFOR                   :1;
    };
} OSCSTATbits_t;
